{
	"name": "Супниці",
	"icon": "caupona:stew_pot",
	"category": "caupona:intro",
	"sortnum": 1,
	"pages": [
		{
			"type": "smelting",
			"recipe": "caupona:stew_pot",
			"text": "Супниці — це інструмент для приготування $(l:intro/soup)супу$(/l). Вона має бути на будь-якому джерелі тепла, наприклад, $(l:intro/stove)кухонних плитах$(/l) або $(l:worldgen/volcanic_fumarole)фумарольних отворах$(/l)."
		},
		{
			"type": "text",
			"text": "У графічному інтерфейсі кнопки зліва починають готування і перемикають керування редстоуном відповідно. Середні слоти 3х3 призначені для інгредієнтів, а резервуар для рідини — як для подачі базової рідини, так і для виведення рагу. Слот праворуч можна використовувати для взаємодії з чашами для вводу/виводу. Ви також можете взаємодіяти з рідинами всередині горщиків, клацаючи Пкс по контейнерах, і використовувати клавіші shift + Пкм порожньою рукою, щоб спорожнити горщик."
		},
		{
			"type": "text",
			"text": "Супниця може кип'ятити, готувати, концентрувати, змішувати. Слот для інгредієнтів не взаємодіє під час готування, а резервуар для рідини не взаємодіє під час будь-якої операції."
		},
		{
			"type": "text",
			"text": "Коли горщик активовано, він спочатку намагається закип'ятити рідину. Після закипання він почне готувати, коли будуть виконані умови (див. нижче)."
		},
		{
			"type": "text",
			"text": "Приготування їжі можливе, коли в горщику більше однієї миски з рідиною і не менше 3 предметів на кожну миску. Крім того, не повинно бути нічого, що не можна приготувати. Приготування їжі призведе до випаровування об'єму рідини, що дорівнює мисці (250 мБ)."
		},
		{
			"type": "text",
			"text": "Коли в горщику є будь-який суп, ви можете додати основу, кип'ячену чи не кип'ячену, щоб розбавити його. Ви також можете додати інший суп всередину, щоб перемішати. Розведення або змішування розпочнеться автоматично. У супниці також можна готувати без додавання інгредієнтів, це буде операція концентрування, витрачаючи миску з водою і концентруючи суп."
		},
		{
			"type": "text",
			"text": "Ви можете додавати пляшки з зіллям всередину при будь-якому способі приготування, але подвоївши тривалість і не більше трьох різних видів зілля на кожну миску супу."
		},
		{
			"type": "text",
			"text": "Супниця намагатиметься почати готувати, коли буде подано сигнал редстоуну та увімкнуться налаштування, що дозволяє повністю автоматизувати процес готування."
		}
	]
}