
{
  "name": "Stew pots",
  "icon": "caupona:stew_pot",
  "category": "intro",
  "priority": true,
  "pages": [
    {
      "type": "crafting",
      "recipe": "caupona:clay_cistern"
    },
    {
      "type": "smelting",
      "recipe": "caupona:stew_pot",
      "text": "Stew pots is tool for cooking soup. It should be on any kind of $(l:stove)stove$(/l)."
    },
    {
      "type": "text",
      "text": "On the left, there's progress bar and control buttons. On the middle, there're 9 ingredient slots and a fluid tank. On the right is bowl interact slot, bowl of fluids can be inserted or extracted. Moreover, You can use fluid container and click the pot to interact with fluids, shift+right click with empty hand to empty the pot."
    },
     {
      "type": "text",
      "text": "Stew pot can do boiling/cooking/concerntration/mixing. Ingredient slot uninteractable when cooking, while fluid tank uninteractable during any of operation."
    },
    {
      "type": "text",
      "text": "When a pot is activate, it would first try to boil fluids. After boiling, it would start cooking when conditions(See below) meet."
    },
    {
      "type": "text",
      "text": "Cooking is available when there're more than a bowl of fluid inside the pot and less than 3 items for each bowl. Also, there should not be anything uncookable. Cooking would evaporate a bowl of fluid. "
    },
    {
      "type": "text",
      "text": "When there's any soup in the pot, you can add base whether boiled or not to dilute. You can also add other soup insid to mix. Dilute or mixing would start a mixing operation automatically. Stew pot can also cooking without adding ingredient, it would be a concerntrate operation, losing a bowl of water and concerntrate the soup."
    },
    {
      "type": "text",
      "text": "You can add potion bottles inside in any kind of cooking, but double duration and three different kind of potion for each bowl of soup at most."
    },
    {
      "type": "text",
      "text": "Stew pot would try to start cooking when redstone signal and settings on, making it possible to fully automate cooking process."
    }
  ]
}