
{
  "name": "Stew Pots",
  "icon": "caupona:stew_pot",
  "category": "caupona:intro",
  "sortnum": 1,
  "pages": [
    {
      "type": "crafting",
      "recipe": "caupona:clay_cistern"
    },
    {
      "type": "smelting",
      "recipe": "caupona:stew_pot",
      "text": "Stew pot is the utensil to make soups & stews. Place the pot onto a heat source, e.g. a $(l:stove)stove$(/l), to make it work."
    },
    {
      "type": "text",
      "text": "In the GUI, you can add up to nine ingredient items to the pot. Right click the pot with liquid containers will add liquid into it. Bowls (empty or containing fluid) and spice jars could interact with the slots on the upper right. Shift + right click with an empty hand will empty the pot. Cooking process and redstone signals are controlled by buttons on the left."
    },
    {
      "type": "text",
      "text": "Stew pot is used mainly to boil liquids and cook soups, but also used in a few other recipes. When cooking, you cannot interact with the ingredient slots, while the liquid tank cannot be interacted during all kinds of work."
    },
    {
      "type": "text",
      "text": "A stew pot will always try to boil liquid inside it first; then if it contains ingredients that match any recipe, cooking will start."
    },
    {
      "type": "text",
      "text": "Cooking could start only when the stew pot contains more than one bowl of base liquid, and ingredients less than three times the amount in bowls of liquid. One bowl of liquid will be lost after cooking. Illegal ingredients spoil the cooking process."
    },
    {
      "type": "text",
      "text": "You can add additional base liquid (boiled or not) or another soup to a non-empty stew pot, in order to dilute or mix the soup inside. These processes take place automatically. Soups could be re-cooked, during which they will become thicker due to base liquid lost."
    },
    {
      "type": "text",
      "text": "You can add potions into a stew pot so that the resultant would provide effects. Up to three effects could co-exist."
    },
    {
      "type": "text",
      "text": "Stew pots could start cooking according to redstone signals, if such setting is on, by which you could automate soup cooking process."
    }
  ]
}