{
	"name": "Котелок для тушения",
	"icon": "caupona:stew_pot",
	"category": "caupona:intro",
	"sortnum": 1,
	"pages": [
		{
			"type": "smelting",
			"recipe": "caupona:stew_pot",
			"text": "Котелок для тушения - это инструмент для приготовления супа. Он должен находиться на любом источнике тепла, например $(l:intro/stove)печь$(/l) или $(l:worldgen/volcanic_fumarole)жерло фумаролы$(/l)."
		},
		{
			"type": "text",
			"text": "Слева - индикатор прогресса и кнопки управления. В центре - 9 слотов для ингредиентов и резервуар для жидкости. Справа находится слот для взаимодействия с миской, миска с жидкостью может быть вставлена или извлечена. Шифт+ПКМ пустой рукой, чтобы слить жидкость из резервуара."
		},
		{
			"type": "text",
			"text": "Горшок может кипятить/готовить/консервировать/смешивать. Слот для ингредиентов не взаимодействует во время готовки, а резервуар для жидкости не взаимодействует во время любой операции.."
		},
		{
			"type": "text",
			"text": "Когда котелок включается, он сначала пытается вскипятить жидкость. После закипания она начнет готовить, если будут выполнены условия (см. ниже)."
		},
		{
			"type": "text",
			"text": "Приготовление пищи возможно, если в котелке находится более одной миски жидкости и менее 3 предметов для каждой миски. Кроме того, не должно быть ничего непригодного для приготовления пищи. Приготовление пищи приведет к испарению миски с жидкостью."
		},
		{
			"type": "text",
			"text": "Когда в котелке остается суп, можно добавить основу, неважно, вареную или нет, чтобы разбавить. Вы также можете добавить другой суп для смешивания. Разбавление или смешивание автоматически запускает операцию смешивания. Котелок для тушения может готовить и без добавления ингредиентов, это будет операция концетрации, когда в миску наливается вода и концетрируется суп."
		},
		{
			"type": "text",
			"text": "Вы можете добавлять бутылочки с зельем внутрь при приготовлении любой пищи, но не более двойной продолжительности и трех разных видов зелья на каждую миску супа."
		},
		{
			"type": "text",
			"text": "Котелок для тушения будет пытаться начать приготовление пищи при включении сигнала и настроек редстоуна, что позволяет полностью автоматизировать процесс приготовления пищи."
		}
	]
}