{
	"name": "Сотейники",
	"icon": "caupona:stew_pot",
	"category": "caupona:intro",
	"sortnum": 1,
	"pages": [
		{
			"type": "smelting",
			"recipe": "caupona:stew_pot",
			"text": "Сотейники - інструмент для приготування супу. Сотейник має бути розташованим на будь-якому джерелі тепла, наприклад: $(l:intro/stove)печі$(/l) чи на $(l:worldgen/volcanic_fumarole)фумароловому отворі$(/l)."
		},
		{
			"type": "text",
			"text": "Ліворуч є панель прогресу та кнопки керування. Посередині є 9 слотів для інгредієнтів і резервуар для рідини. Праворуч знаходиться слот для взаємодії миски, миски з рідинами можна вставляти або витягувати. Крім того ви можете використовувати контейнер для рідини та клацнути по сотейнику, щоб взаємодіяти з рідинами, Shift + ПКМ порожньою рукою, щоб спустошити сотейник."
		},
		{
			"type": "text",
			"text": "Сотейник може кіп'ятити/варити/концетрувати/змішувати. Слот для інгредієнтів неможливо взаємодіяти під час готування, тоді як резервуар для рідини не може взаємодіяти під час будь-якої операції."
		},
		{
			"type": "text",
			"text": "Коли сотейник активується, він спочатку намагатиметься закип'ятити рідину. Після закипання воно почне варитися, коли виконаються умови(див. нижче)."
		},
		{
			"type": "text",
			"text": "Готування можливе, якщо в сотейнику міститься більше ніж одна миска рідини та меньше 3 предметів для кожної миски. Також не повинно бути нічого недовареного. При варінні миска рідини випаровується."
		},
		{
			"type": "text",
			"text": "Коли в сотейнику є якийсь суп, можна додати основу, варену чи нерозбавлену. Ви також можете додати всередину інший суп для перемішування. Розведення або змішування розпочне операцію змішування автоматично. Сотейник також може готувати без додавання інгредієнтів."
		},
		{
			"type": "text",
			"text": "Ви можете додати плашки з зіллям в будь-який вид приготування, але щонайбільше подвійну тривалість і три різні види зілля для кожної миски супу."
		},
		{
			"type": "text",
			"text": "Сотейник спробує розпочати готування, коли ввімкнеться сигнал червоного каменю і налаштування, що дозволить повністю автоматизувати процес приготування."
		}
	]
}